Revit 2020 API
MetallicPaint Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class MetallicPaint
Visual Basic
Public NotInheritable Class MetallicPaint
Visual C++
public ref class MetallicPaint abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.MetallicPaint
See Also
MetallicPaint Members
Autodesk.Revit.DB.Visual Namespace